app/controllers/api/v1/reservations_controller.rb

SELECT "reservations".* FROM "reservations" ORDER BY created_at DESC
---
  def index
    reservations = Reservation.order('created_at DESC')